Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: The provider must implements the interface ``Kanboard\Core\User\Avatar\AvatarProviderInterface``:
ja: プロバイダのインターフェースは ``Kanboard\Core\User\Avatar\AvatarProviderInterface`` 内で実装されなければなりません :

source: # Install the windows service httpd.exe -k install
ja: # Windows サービスのインストール httpd.exe -k install

source: Kanban uses lead and cycle times to measure performance:
ja: かんばんはリードタイムとサイクルタイムをパフォーマンスの測定に使用します:

source: The icon before the title is updated according to the status.
ja: タイトルの前のアイコンは状態に従って更新されます。

source: Make a new directory: ``app/Locale/xx_XX`` for example ``app/Locale/fr_CA`` for French Canadian 2.
ja: 新しくディレクトリを作成する: ``app/Locale/xx_XX`` 例えば、 ``app/Locale/fr_CA`` はカナダフランス語です。 2.

source: Refresh interval for public board ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 公開ボードの更新頻度 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Doing a backup is very easy, just copy the file ``data/db.sqlite`` somewhere else when nobody use the software.
ja: バックアップを取るのは非常に簡単で、 単に ``data/db.sqlite``ファイルをコピーするだけなのでソフトウェアは何も必要ありません。

source: Comment API Procedures ======================
ja: コメントのAPIプロシージャ ======================

source: Metadata ========
ja: メタデータ ========

source: // By default, the log file is in data/debug.log but you can change the path: define('LOG_FILE', '/path/to/debug.log');
ja: // デフォルトでは、ログは data/debug.logに保存されますが、変更することもできます。

source: Register a new link provider ----------------------------
ja: 新しいリンクのプロバイダを登録する ----------------------------

source: cronjob Execute daily cronjob
ja: cronjob 毎日のcronjobを実行する

source: Each automatic action is defined with these properties:
ja: 各々の自動アクションはこれらのプロパティで定義されます:

source: - Task creation is **allowed** only for a specific column - Task creation is **blocked** only for a specific column - Closing or opening a task is **allowed** only for a specific column - Closing or opening a task is **blocked** only for a specific column
ja: - 特定のカラムのみでタスクの作成を **許可する** - 特定のカラムのみでタスクの作成を **ブロックする** - 特定のカラムのみでタスクの作成/完了を **許可する** - 特定のカラムのみでタスクの作成/完了を **ブロックする**

source: Add symlink to Kanboard folder into your Apache docroot:
ja: Apache の docroot に Kanboardフォルダのシンボリックリンクを追加 :

source: Tasks on the board can be displayed in collapsed or in expanded mode.
ja: ボード上のカードは簡略表示と詳細表示ができます。

source: If the user is not found inside the database, a LDAP authentication is performed 3.
ja: データベース内にユーザーが見つからない場合、LDAP認証を行います。 3.

source: - Download the user profile picture from Active Directory
ja: - ユーザープロフィール用の画像をActive Directoryからダウンロードする

source: Search by completion date with range ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 完了日を範囲検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: This tool can be used only on the local machine.
ja: このツールはローカルPCからのみ使用可能です。

source: Those classes are available everywhere in the application and only one instance is created.
ja: これらのクラスはインスタンスを一つ作るだけで、アプリケーションのどこからでも利用可能です。

source: - Have LDAP authentication properly configured
ja: - LDAP認証が正しく設定されている

source: - **dependency** (string, optional)
ja: - **type** (string, 任意)

source: - Only for tasks assigned to you
ja: - 自分のタスクのみ

source: Each version of PHP is tested against the 3 supported database: Sqlite, Mysql and Postgresql.
ja: 各バージョンのPHPで、サポートされている3つのデータベースでテストされます: Sqlite, Mysql とPostgresql です。

source: There are also several third-party applications that can be used to take screenshots with annotations and shapes.
ja: また、いくつかのサードパーティーのアプリケーションは注記やシェイプ付きのスクリーンショットを取れます。

source: // It's the same thing as using the container:
ja: // コンテナを使用するのと同じ事が起きます:

source: When the end-user go to the URL ``/my/custom/route``, the method ``Kanboard\Plugin\Myplugin\Controller\MyController::myAction()`` will be executed.
ja: エンドユーザーが ``/my/custom/route`` のURLにアクセスした時、``Kanboard\Plugin\Myplugin\Controller\MyController::myAction()`` メソッドが実行されます。

source: File upload:
ja: ファイルのアップロード:

source: # Start a new dyno with a Postgresql database heroku ps:scale web=1 heroku addons:add heroku-postgresql:hobby-dev
ja: # Postgresql データベースと共に新しい dyno を起動する heroku ps:scale web=1 heroku addons:add heroku-postgresql:hobby-dev

source: // Allow automatic LDAP user creation
ja: // 自動でLDAP ユーザーの作成を許容する

source: - Add more events to the project calendar
ja: - プロジェクトのカレンダーにイベントを追加する

source: - Ready to ship
ja: - 出荷準備済

source: Some plugins may requires to be installed into the document root.
ja: いくつかのプラグインは document root以下にインストールされることを要求する可能性があります。

source: - Result on success: **List of subtasks**
ja: - 成功時の返り値: **サブタスクのリスト**

source: You can run tests across different databases (Sqlite, Mysql and Postgresql) to be sure that the result is the same everywhere.
ja: 異なるデータベース(Sqlite, MySQL, PostgreSQL) を横断して、どれでも同じ結果が得られるようにテストができます。

source: - **user_id** (integer, optional)
ja: - **user_id** (integer, 任意)

source: - Purpose: **Update external task link**
ja: - 用途: **タスクの外部リンクのアップデート**

source: - ``getExternalGroupIds()``: Get external group ids, automatically sync group membership if present
ja: - ``getExternalGroupIds()``: 外部グループのIDを取得し、もしあれば自動でグループのメンバーシップを同期する

source: The external task provider expose a form to the user to be able to fetch the external task 3.
ja: 外部のタスクのプロバイダはユーザーが外部タスクを取得できる書式で陳列する 3.

source: If the connected user is not allowed to access to the resource, you will receive a ``403 Forbidden``.
ja: 接続しているユーザーがリソースへのアクセスを許可されていないなら、 ``403 Forbidden``を返します。

source: - LDAP user
ja: - LDAP のユーザー

source: Read one entry:
ja: 一つのエントリーを読み込む:

source: - If the task is not closed the current time is used instead of the date of completion.
ja: - タスクがクローズされていない場合、完了までの時間の代わりに現在既に経過した時間で代用します。

source: Time Tracking =============
ja: 時間の追跡 =============

source: - Local checkout of the Git repository
ja: - ローカルにチェックアウトしたGitリポジトリ

source: Kanboard use the `Markdown syntax <http://en.wikipedia.org/wiki/Markdown>`__ for comments or task descriptions.
ja: Kanboard は、コメントやタスクの詳細の記入に `Markdown 記法 <http://ja.wikipedia.org/wiki/Markdown>`を使用します。

source: Project File API Procedures ===========================
ja: プロジェクトのファイルのAPIプロシージャ ===========================

source: - Moving tasks only between specified columns
ja: - 特定のカラム間でのみタスクの移動を許可する

source: - Limits help avoid working on too many tasks at the same time
ja: - 同時にあまりにも多くのタスクを処理するのを避けるよう制限します

source: You can have a group of people that are allowed to move tasks only from the column “Work in progress” to the column “Done”.
ja: グループ内の人々には、カラム "仕掛" から カラム"完了" へのタスクの移動だけを許可することができます。

source: When you will have to upgrade Kanboard, run this command:
ja: Kanboardのアップグレードに必要な事が出来たら、以下のコマンドを実行してください:

source: Stylesheet and Javascript files are merged together and minified.
ja: スタイルシートと Javascript ファイルは両方をマージした縮小版です。

source: Build Javascript:
ja: Javascriptのビルド:

source: - Backlog
ja: - 残り作業

source: Usage Examples --------------
ja: 使用例: --------------

source: Example for OpenLDAP --------------------
ja: OpenLDAP の例 --------------------

source: Request example to change the task color:
ja: タスクの色を変えるリクエストの例:

source: - **role** (string, optional)
ja: - **role** (string, 任意)

source: Kanboard can download automatically user pictures from the LDAP server.
ja: Kanboard はLDAPサーバーからユーザーの画像を自動的にダウンロードします。

source: - Purpose: **Update task link**
ja: - Purpose: **タスクのリンクのアップデート**

source: Use at your own risk.
ja: 自己責任で使用してください。

source: figure:: /_static/add-subtask-shortcut.png :alt: Add a subtask from the task view
ja: figure:: /_static/add-subtask-shortcut.png :alt: タスクビューからサブタスクを追加

source: Lean Business Management ~~~~~~~~~~~~~~~~~~~~~~~~
ja: リーンビジネスのマネジメント ~~~~~~~~~~~~~~~~~~~~~~~~

source: - Purpose: **Update a group**
ja: - 用途: **グループの更新**

source: - Choose the event: **Task creation or modification**
ja: - イベント: **タスクの作成または変更** を選択

source: To implement a new link provider from a plugin, you need to create 2 classes that implement those interfaces:
ja: プラグインから新しいリンクのプロバイダを実装するには、これらのインターフェースの実装から2つのクラスを作成しなければなりません。

source: figure:: /_static/cfd.png :alt: Cumulative flow diagram
ja: figure:: /_static/cfd.png :alt: 累積フロー図

source: - Do not use Sqlite on a disk with poor IOPS, it’s always preferable to use local SSD drives
ja: - IOPSが低いディスクでSqliteを使用しない。常にローカルのSSDドライブを使用するのが望ましい。

source: Test with curl:
ja: curlでテストします:

source: API Reference =============
ja: API リファレンス =============

source: This parameter is used for email notifications.
ja: このパラメーターはEmail通知で使用されます。

source: Example of ``Plugin.php`` file (``plugins/Foobar/Plugin.php``):
ja: ``Plugin.php`` (``plugins/Foobar/Plugin.php``) ファイルの例:

source: Rename the file ``config.default.php`` to ``config.php`` and change these values:
ja: ``config.default.php`` を ``config.php`` にリネームして、以下の値を変更してください:

source: For example, you can do that from MySQL client:
ja: 例えば、MySQLクライアントからこのようにします:

source: - Choose the format iCalendar
ja: - iCalenderフォーマットを選択する

source: Enable Public Access ~~~~~~~~~~~~~~~~~~~~
ja: 公開アクセスを有効にする ~~~~~~~~~~~~~~~~~~~~

source: - The start date of the calendar event is the creation date of the task.
ja: - カレンダー上のイベントの開始日はタスクの作成日になります。

source: Go to the **"Project settings"**, and from the menu on the left, at the bottom, choose **"Remove"**.
ja: **"このプロジェクトの設定"** を開き、左側のメニューの一番下の **"削除"** を選択してください。

source: Installation on OpenSuse ========================
ja: OpenSuse へのインストール ========================

source: - Result on success: **columns properties**
ja: - 成功時の返り値: **カラムのプロパティ**

source: figure:: /_static/task-duplication.png :alt: Task Duplication
ja: figure:: /_static/task-duplication.png :alt: タスクの複製

source: The file upload size is not defined by Kanboard itself but by PHP and your webserver.
ja: ファイルのアップロードサイズ上限はKanboard自身では定義しておらず、webサーバーとPHPの設定によります。

source: The Travis config file ``.travis.yml`` is located on the root directory of Kanboard.
ja: Travis-CIの設定ファイルは Kanboard のルートディレクトリにある ``.travis.yml`` です。

source: Fetch and extract ports…
ja: portsをfetchして展開する…

source: Email Configuration ===================
ja: Email の設定 ===================

source: Note: This method will install the **current development version**, use at your own risk.
ja: 注意: この方法は **現在開発中のバージョン** をインストールするため、自己責任で使用してください。

source: Administrator's Guide =====================
ja: 管理者用ガイド =====================

source: For **remote users**, only the username is mandatory.
ja: **リモートユーザー** では、必須なのはユーザー名だけです。

source: Here an example with Sqlite:
ja: ここに、Sqlite の場合の例を示します:

source: - MySQL >= 5.6 or MariaDB >= 10
ja: - MySQL 5.6以上 or MariaDB 10以上

source: - Submit form = **CTRL+ENTER** or **⌘+ENTER**
ja: - フォームを送信 = **CTRL+ENTER** or **⌘+ENTER**

source: // If you need to change the sendmail command, replace the value
ja: // "sendmail" コマンドを変更する必要がある場合、この値を置き換える

source: - Changes can be made at any time
ja: - 随時変更が可能

source: The external task is retrieved from the other system 4.
ja: 外部タスクが別のシステムから引き出される 4.

source: Pull-requests are always welcome.
ja: プルリクエストはいつでも歓迎します。

source: - Go to the list view of the project #8: **/l/8**
ja: - プロジェクト #8 のリストビューを表示: **/l/8**

source: The argument ``$input`` is the text entered from the user interface.
ja: 引数 ``$input`` はユーザーインターフェースから入力されたテキストです。

source: For this example we use the anonymous binding.
ja: この例は、anonymous bindingを使用します。

source: - Open a terminal and go to your Kanboard directory (example:
ja: - ターミナルを開き、Kanboardのインストールされたディレクトリに移動する (例: ``cd /var/www/kanboard``)

source: However, if your plugin fires new events, you can register these events like that:
ja: しかしながら、あなたが新しいイベントを作動させたいならば、これらのイベントを以下の要領で登録できます。

source: Your handler can be registered for user or project notification.
ja: ユーザー or プロジェクトの通知のために、ハンドラが登録されます。

source: - Unix operating system (Mac OS or Linux)
ja: - Unix系のOS (Mac OS か Linux)

source: // Enable/disable email configuration from the user interface
ja: // ユーザーインターフェースからの email 設定の有効化/無効化

source: Depending on your configuration, some features can slow down the application if they are executed in the same process as the HTTP request.
ja: 設定によっては、HTTPリクエストを同じプロセスで処理している場合、アプリケーションのいくつかの機能は速度低下を引き起こし得ます。

source: When I move a task to the column “To be validated”, assign this task to a specific user ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: カラム “To be validated” にタスクを移動したら、タスクの担当者を割り当てる ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Arguments:
ja: - 引数:

source: Link Settings -------------
ja: リンクの設定 -------------

source: // Mysql/Postgres username
ja: // Mysql/Postgres でのユーザー名

source: // Example for OpenLDAP: 'uid=%s'
ja: // OpenLDAPでの例: 'uid=%s'

source: - Purpose: **Move a task to another column, position or swimlane inside the same board**
ja: - 用途: **同一ボード内でタスクを別の位置/カラム/スイムレーンに移動する**

source: // Get a value only for a task
ja: // タスクのみの値を取得する

source: +-------------------------+-------------------------------------------------------+ | Path | Description | +=========================+=======================================================+ | /var/www/app/data | Application data (Sqlite database, attachments, etc.) | +-------------------------+-------------------------------------------------------+ | /var/www/app/plugins | Plugins | +-------------------------+-------------------------------------------------------+ | /etc/nginx/ssl | SSL certificates | +-------------------------+-------------------------------------------------------+
ja: +-------------------------+-------------------------------------------------------+ | パス | 概要 | +=========================+=======================================================+ | /var/www/app/data | アプリケーションデータ (Sqliteのデータベース, 添付ファイルなど) | +-------------------------+-------------------------------------------------------+ | /var/www/app/plugins | プラグイン | +-------------------------+-------------------------------------------------------+ | /etc/nginx/ssl | SSL 証明書 | +-------------------------+-------------------------------------------------------+

source: - Go to the project settings for the project id #42: **/p/42**
ja: - プロジェクト #42 のプロジェクト設定を表示: **/p/42**

source: When this constant is at ``true``:
ja: この定数を ``true`` にした場合:

source: To do that, you have to specify the URL of your Kanboard installation in your Application Settings.
ja: これをするには、アプリケーション設定から自分のKanboardのURLを設定する必要があります。

source: In your ``config.php``, you have to set the LDAP attribute used to store the image.
ja: ``config.php`` 内で、画像の保存に使用するLDAP属性を設定しなければなりません。

source: When a task is completed, duplicate this task to another project ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクが完了したときに、別のプロジェクトにタスクを複製する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - At the moment, only the task description and the comment text area have this feature enabled.
ja: - 現時点では、この機能はタスクの概要とコメントでのみ有効です。

source: For example, your plugin can add a mail transport for a provider that uses an HTTP API.
ja: 例えば、HTTP APIを使ってメールを送信するプラグインを追加することができます。

source: Project Settings ----------------
ja: プロジェクト設定 ----------------

source: Note: Kanboard always fallback to old school URLs when it’s not configured, this configuration is optional.
ja: 注意: Kanboard はこの設定ができていない場合、いつでも従来通りのURLにフォールバックします。この設定は任意です。

source: - Purpose: **Get available dependencies for a given provider**
ja: - 用途: **提供元が使用可能な依存関係を取得する**

source: // LDAP Base DN for groups
ja: // グループのLDAP Base DN

source: - The debug mode logs all SQL queries and the time taken to generate pages.
ja: - デバッグモードのログはすべてSQLクエリで、ページの生成に時間が掛かります。

source: // Database driver: sqlite, mysql or postgres (sqlite by default) define('DB_DRIVER', 'sqlite');
ja: // データベースのドライバ: sqlite, mysql, postgres (デフォルトは sqlite ) define('DB_DRIVER', 'sqlite');

source: Code blocks ~~~~~~~~~~~
ja: コードブロック ~~~~~~~~~~~

source: Background Job ==============
ja: バックグラウンドジョブ ==============

source: - OAuth2 users
ja: - OAuth2 のユーザー

source: Ordered lists are prefixed by a number like that:
ja: 番号付きリストは、以下のように行頭に番号が付きます:

source: - Purpose: **Grant access to a project for a user**
ja: - 用途: **ユーザーにプロジェクトへのアクセス権を与える**

source: You can use this one click install button or follow the manual instructions below:
ja: このワンクリックインストールボタンを使用するか、以下の手順に従って手動で構築することができます:

source: Metadata types --------------
ja: メタデータのタイプ --------------

source: - Since Kanboard > v1.2.5, the tag "latest" point to the latest stable release instead of the master branch
ja: - Kanboard v1.2.5 以降では、"latest" タグはマスターブランチの代わりに最新安定版リリースを指します。

source: Only administrators can create new groups and assign users.
ja: システム管理者のみが新しいグループの作成とユーザーの割り当てを行えます。

source: // LDAP server hostname
ja: // LDAP のサーバーのホスト名

source: And here, an *italic* word with one _underscore_.
ja: また、一つの_アンダーバーかアスタリスク_で囲むと、*斜体*になります。

source: - Purpose: **Get project information**
ja: - 用途: **プロジェクトの情報を取得する**

source: - If you use an aggressive OPcode caching, reload your web-server or php-fpm
ja: - aggressive OPCode キャッシュを使用している場合、webサーバーかphp-fpmをリロードする

source: - Have time tracking information: **time spent** and **time estimated**
ja: - 時間の追跡の情報を持ちます: **経過時間** と **見積時間**

source: - Check the PHP and Apache error logs
ja: - PHPとApacheのエラーログを確認する

source: Available commands:
ja: 利用可能なコマンド:

source: I’m not able to login with Internet Explorer and Microsoft IIS --------------------------------------------------------------
ja: Microsoft IIS とInternet Explorerにおいてログインできない --------------------------------------------------------------

source: // LDAP attribute for the user in the group filter 'username' or 'dn'
ja: // グループ内で 'username' or 'dn' でユーザーをフィルタするLDAP属性

source: A blank line will produces the same effect:
ja: 空の行の挿入も同じ効果があります:

source: Creating Projects for Multiple Users ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: チームプロジェクトを作成する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Install the `Kanboard plugin for Beanstalk <https://github.com/kanboard/plugin-beanstalk>`__
ja: - `Kanboard plugin for Beanstalk <https://github.com/kanboard/plugin-beanstalk>`__ をインストールしてください。

source: - This calendar shows only tasks for the selected project.
ja: - このカレンダーは選択したプロジェクトのタスクのみを表示します。

source: // Enable LDAP START_TLS
ja: // LDAP START_TLS を有効にする

source: - The start date of the calendar event is the start date of the task.
ja: - カレンダー上のイベントの開始日はタスクの開始日になります。

source: Installation on Microsoft Windows Server ========================================
ja: Microsoft Windows Server へのインストール ========================================

source: - Double click on ``C:\Apache24\bin\ApacheMonitor.exe``, or put it in your startup folder.
ja: - ``C:\Apache24\bin\ApacheMonitor.exe``をダブルクリックするか、これをスタートアップフォルダに入れる。

source: - Purpose: **Create and upload a new project attachment**
ja: - 用途: **新しくプロジェクトに添付ファイルをアップロード・作成する**

source: Visualize your workflow ~~~~~~~~~~~~~~~~~~~~~~~
ja: ワークフローの視覚化 ~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/board-expanded-mode.png :alt: Tasks expanded
ja: figure:: /_static/board-expanded-mode.png :alt: タスクの詳細表示

source: - Example: ``tag:"My tag"``
ja: - 例: ``tag:"My tag"``

source: However, it’s possible to improve that.
ja: しかしながら、これは補強することが可能です。

source: - Purpose: **Get metadata related to a task by task unique id and metakey (name)**
ja: - 用途: **タスクのユニークなIDとメタキー(名前)から関連するメタデータを取得する**

source: LDAP Library ============
ja: LDAP ライブラリ ============

source: - Result on failure: **false|null**
ja: - 失敗時の返り値: **false | null**

source: Search by creation date with range ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 作成日を範囲検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: # Add permissions
ja: # パーミッションを正しくする(ファイルの所有者を変更する)

source: projects:archive-activities Remove project activities after one year
ja: projects:archive-activities 1年以上前のプロジェクトのアクティビティを削除する

source: Calendar subscriptions are **read-only** access, you cannot create tasks from external calendar software.
ja: カレンダー配信は **read-only** アクセスで、外部のカレンダーソフトウェアからタスクをつくる事は出来ません。

source: - Purpose: **Create a new task**
ja: - Purpose: **新しくタスクを作成する**

source: Plugins -------
ja: プラグイン -------

source: Otherwise Kanboard will try to override the value directly in PHP.
ja: さもなくば、KanboardはPHPの値でオーバーライドしようとします。

source: Check with your local installation of Kanboard and send a `pull-request <https://help.github.com/articles/using-pull-requests/>`__
ja: ローカルにインストールしたKanboardで確認し、`Githubにプルリクエストを送る <https://help.github.com/articles/using-pull-requests/>`__

source: - All operations are logged with the execution time (HTTP requests, Email notifications, SQL requests)
ja: - 全ての動作(HTTPリクエスト、Email通知、SQLリクエスト)を実行時間とともにログを取る

source: This functionality allows you to link a task to additional items stored on another system.
ja: この関数はタスクと別のシステムに保存されているアイテムのリンクの追加を許容します。

source: Visualization:
ja: 可視化:

source: // This filter is used to find the groups of our user define('LDAP_GROUP_USER_FILTER', '(&(objectClass=groupOfNames)(member=uid=%s,ou=Users,dc=kanboard,dc=local))');
ja: // このフィルターはユーザーがグループを探すのに使用されます define('LDAP_GROUP_USER_FILTER', '(&(objectClass=groupOfNames)(member=uid=%s,ou=Users,dc=kanboard,dc=local))');

source: Project Types -------------
ja: プロジェクトのタイプ -------------

source: Download the `source code <https://github.com/kanboard/kanboard/releases/latest>`_ and copy the directory ``kanboard`` where you want 3.
ja: `ソースコード <https://github.com/kanboard/kanboard/releases/latest>`_ をダウンロードして、 ``kanboard`` ディレクトリを適切な場所にコピーしてください。 3. 3.

source: Board view ----------
ja: ボードビュー ----------

source: - **group_id** (integer, required)
ja: - **group_id** (integer, 必須)

source: - The PHP extension ``pdo_mysql`` installed
ja: - PHP 拡張 ``pdo_mysql`` がインストールされている

source: - **Cycle time**: Time between task start and completion
ja: - **サイクルタイム**: タスクを開始してから、完了するまでの時間

source: If you use PHP < 7.0, you need to have the openssl extension enabled or ``/dev/urandom`` accessible from the application if restricted by an ``open_basedir`` restriction.
ja: PHP 7.0 以前を使用している場合で、 ``open_basedir`` の制限をしている場合 、OpenSSL拡張を有効にするか、アプリケーションから ``/dev/urandom`` へのアクセスを有効にする必要があります。

source: Include closed tasks in the cumulative flow diagram ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 累積フロー図に完了したタスクを含める ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: When you create a new project, you can choose to duplicate the properties of another project:
ja: 新しいプロジェクトを作成するときに、他のプロジェクトからこれらのプロパティを複製することができます:

source: -v|vv|vvv, --verbose Increase the verbosity of messages: 1 for normal output, 2 for more verbose output and 3 for debug
ja: -v|vv|vvv, --verbose vの数が増える毎に詳細に出力する: -v は通常の出力で、-vv はもっと詳細に出力し、そして-vvvはデバッグ用です。

source: - **status_id**: The value 1 for active tasks and 0 for inactive (integer, required)
ja: - **status_id**: この値を1にすると活動中のタスクを、0にすると活動中でないタスクを取得します (integer, 必須)

source: If you would like to replace the default HTTP Content Security Policy header, you can use the method ``setContentSecurityPolicy()``:
ja: デフォルトの HTTP コンテンツのセキュリティポリシーヘッダーを置き換える事を望むならば、 ``setContentSecurityPolicy()`` メソッドが利用できます:

source: - If you use SeLinux, allow PHP to send emails
ja: - SELinuxを使用している場合、PHPにメール送信を許可する

source: Sharing Boards and Tasks ------------------------
ja: ボードとタスクを共有する ------------------------

source: - User calendar (available from the dashboard)
ja: - ユーザーのカレンダー (ダッシュボードから利用可能)

source: - Purpose: **Get the list of all swimlanes of a project (enabled or disabled) and sorted by position**
ja: - 用途: **プロジェクトの全てのスイムレーン(有効か無効かを問わない)のリストを取得し、スイムレーンの位置順にソート**

source: - Password: none
ja: - パスワード: none

source: Create a file named ``phpinfo.php`` in the folder ``C:\Apache24\htdocs``:
ja: ``phpinfo.php`` という名前で、``C:\Apache24\htdocs``に以下の内容のファイルを作成する:

source: If the credentials are wrong, you will receive a ``401 Not Authorized`` and the corresponding JSON response.
ja: 資格情報が正しくない場合、 ``401 Not Authorized`` と、対応するJSONレスポンスを返します。
